Tekla.Structures.Model.Model.GetIdentifierByGUID(System.String)
Returns an identifier instance that has the given GUID in the model.
GUID: The GUID to look for in the model.
Returns: The identifier of the GUID, or null if not found.

Tekla.Structures.Model.Model.GetGUIDByIdentifier(Tekla.Structures.Identifier)
Returns the GUID of the given identifier instance.
ID: The identifier to look for in the model.
Returns: The GUID of the identifier.